JayHeng/RT-MFB/boards/mimxrt/mfb_fw/src/mfb.c
void mfb_show_mem_size(uint8_t capacityID)
{
#if MFB_LOG_INFO_ENABLE
    mfb_printf("MFB: Flash Capacity ID: 0x%x", capacityID);
    uint32_t flashMemSizeInKB = mfb_decode_capacity_id(capacityID)/ 0x400;
    if (flashMemSizeInKB <= 0x400)
    {
        mfb_printf(" -- %dKB.\r\n", flashMemSizeInKB);
    }
    else
    {
        mfb_printf(" -- %dMB.\r\n", flashMemSizeInKB / 0x400);
    }
#endif
}

void mfb_main(void)
{
    status_t status;
    uint32_t jedecID = 0;
    uint8_t manufacturerID = 0;
    uint8_t memoryTypeID = 0;
    uint8_t capacityID = 0;

    mfb_printf("\r\n-------------------------------------\r\n");
    mfb_printf("MFB: i.MXRT multi-flash boot solution.\r\n");
    cpu_show_clock_source();
    
    /* Init FlexSPI pinmux */
    flexspi_port_switch(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_2PAD);
    flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_2PAD);

    /* Move FlexSPI clock to a stable clock source */ 
    flexspi_clock_init(EXAMPLE_FLEXSPI, kFlexspiRootClkFreq_30MHz);
    /* Init FlexSPI using common LUT */ 
    flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUTCommonMode, kFLEXSPI_ReadSampleClkLoopbackInternally);
    mfb_printf("\r\nMFB: FLEXSPI module is initialized to 1bit SDR normal read mode.\r\n");
    flexspi_show_clock_source(EXAMPLE_FLEXSPI);

    /* Get JEDEC ID. */
#if MFB_FLASH_FAKE_JEDEC_ID_ENABLE
    jedecID = MICRON_OCTAL_FLASH_JEDEC_ID;
#else
    status = flexspi_nor_get_jedec_id(EXAMPLE_FLEXSPI, &jedecID);
    if (status != kStatus_Success)
    {
        mfb_printf("MFB: Get Flash Vendor ID failed.\r\n");
    }
    else
#endif
    {
        bool isOctalFlash = false;
        bool isValidVendorId = true;
        uint8_t dummyValue = 0;
        manufacturerID = jedecID & 0xFF;
        memoryTypeID = (jedecID >> 8) & 0xFF;
        capacityID = (jedecID >> 16) & 0xFF;
        uint32_t flashMemSizeInByte = mfb_decode_capacity_id(capacityID);
        microseconds_init();
        mfb_flash_speed_test();
        mfb_printf("MFB: Flash Manufacturer ID: 0x%x", manufacturerID);
        switch (manufacturerID)
        {
#if MXIC_DEVICE_SERIES
            // MXIC
            case 0xc2:
                {
                    mfb_printf(" -- MXIC Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", memoryTypeID);
                    switch (memoryTypeID)
                    {
                        case 0x20:
                            mfb_printf(" -- MX25L/MX66L/MX25V QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x25:
                            mfb_printf(" -- MX25U/MX66U QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x28:
                            mfb_printf(" -- MX25R QuadSPI 1.8-3.3V Series.\r\n");
                            break;
                        case 0x75:
                            mfb_printf(" -- MX77L QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x80:
                            isOctalFlash = true;
                            mfb_printf(" -- MX25UM/MX66UM OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x81:
                            isOctalFlash = true;
                            mfb_printf(" -- MX25UM51345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x83:
                            isOctalFlash = true;
                            mfb_printf(" -- MX25UM25345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x84:
                            isOctalFlash = true;
                            mfb_printf(" -- MX25UW51345G OctalSPI 1.8V Series.\r\n");
                            break;
                        case 0x85:
                            isOctalFlash = true;
                            mfb_printf(" -- MX25LM/MX66LM OctalSPI 3.3V Series.\r\n");
                            break;
                        // Missing MX25LW51245G, MX66LW1G45G, MX66LW2G45G
                        // Missing MX25UW6445G, MX66UW12845G, MX25UW25645G, MX25UW51245G, MX66UW1G45G, MX66UW2G45G
                        // Missing MX25UW6345G, MX66LW12345G, MX66UW25345G      done                 , MX66UW2G345G
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(capacityID);
#if MXIC_DEVICE_MX25UM51345
                    if (isOctalFlash)
                    {
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_8PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, kFlexspiRootClkFreq_100MHz);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashBusyStatusPol    = MXIC_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = MXIC_FLASH_BUSY_STATUS_OFFSET;
                        s_flashEnableOctalCmd   = MXIC_FLASH_ENABLE_OCTAL_CMD;
                        /* Re-init FlexSPI using custom LUT */
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_MXIC_Octal, kFLEXSPI_ReadSampleClkExternalInputFromDqsPad);
                        /* Enter octal mode. */
                        status = flexspi_nor_enable_octal_mode(EXAMPLE_FLEXSPI);
                    }
#endif
                    break;
                }
#endif // MXIC_DEVICE_SERIES

#if ISSI_DEVICE_SERIES
            // ISSI
            case 0x9d:
                {
                    mfb_printf(" -- ISSI Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", memoryTypeID);
                    switch (memoryTypeID)
                    {
                        case 0x40:
                            mfb_printf(" -- IS25LQ/IS25LP QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x60:
                            mfb_printf(" -- IS25LP/IS25LE QuadSPI 3.3V Series.\r\n");
                            break;
                        case 0x70:
                            mfb_printf(" -- IS25WP/IS25WJ/IS25WE QuadSPI 1.8V Series.\r\n");
                            break;
                        case 0x5A:
                            isOctalFlash = true;
                            mfb_printf(" -- IS25LX OctalSPI 3.3V Series.\r\n");
                            break;
                        case 0x5B:
                            isOctalFlash = true;
                            mfb_printf(" -- IS25WX OctalSPI 1.8V Series.\r\n");
                            break;
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(capacityID);
#if ISSI_DEVICE_IS25WP064A
                    if (!isOctalFlash)
                    {
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_4PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, kFlexspiRootClkFreq_100MHz);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashBusyStatusPol    = ISSI_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = ISSI_FLASH_BUSY_STATUS_OFFSET;
                        s_flashQuadEnableCfg    = ISSI_FLASH_QUAD_ENABLE;
                        /* Re-init FlexSPI using custom LUT */
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_ISSI_Quad, kFLEXSPI_ReadSampleClkLoopbackFromDqsPad);
                        /* Enter quad mode. */
                        status = flexspi_nor_enable_quad_mode(EXAMPLE_FLEXSPI);
                    }
#endif
#if ISSI_DEVICE_IS25WX256
                    if (isOctalFlash)
                    {
                        flexspi_root_clk_freq_t rootClkFreq = kFlexspiRootClkFreq_200MHz;
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_8PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, rootClkFreq);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashBusyStatusPol    = ISSI_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = ISSI_FLASH_BUSY_STATUS_OFFSET;
                        s_flashEnableOctalCmd   = ISSI_FLASH_ENABLE_OCTAL_CMD;
                        /* Re-init FlexSPI using custom LUT */
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_ISSI_Octal, kFLEXSPI_ReadSampleClkExternalInputFromDqsPad);
                        // Set dummy cycle of Flash
                        if (rootClkFreq == kFlexspiRootClkFreq_200MHz)
                        {
                            dummyValue = ISSI_FLASH_SET_DUMMY_CMD;
                            flexspi_nor_set_dummy_cycle(EXAMPLE_FLEXSPI, ISSI_FLASH_SET_DUMMY_CMD);
                        }
                        /* Enter octal mode. */
                        status = flexspi_nor_enable_octal_mode(EXAMPLE_FLEXSPI);
                    }
#endif
                    break;
                }
#endif // ISSI_DEVICE_SERIES

#if WINBOND_DEVICE_SERIES
            // Winbond
            case 0xef:
                {
                    mfb_printf(" -- Winbond Serial Flash.\r\n");
                    mfb_printf("MFB: Flash Memory Type ID: 0x%x", memoryTypeID);
                    switch (memoryTypeID)
                    {
                        case 0x30:
                            mfb_printf(" -- W25X DualSPI 3.3V Series.\r\n");
                            break;
                        case 0x40:
                            mfb_printf(" -- W25QxxxDV/FV/BV/CL/JV(-IQ/JQ) QuadlSPI 3.3V Series.\r\n");
                            break;
                        case 0x60:
                            mfb_printf(" -- W25QxxxFW/EW/NW(-IQ/IN) QuadlSPI 1.8V Series.\r\n");
                            break;
                        case 0x70:
                            mfb_printf(" -- W25QxxxJV(-IM/JM) QuadlSPI 3.3V Series.\r\n");
                            break;
                        case 0x80:
                            mfb_printf(" -- W25QxxxJW/NW(-IM) QuadlSPI 1.8V Series.\r\n");
                            break;
                        // Missing W25H, W25M, W25R
                        // Missing xxxJL, xxxDW, xxxRV
                        default:
                            mfb_printf(" -- Unsupported Series.\r\n");
                            break;
                    }
                    mfb_show_mem_size(capacityID);
#if WINBOND_DEVICE_W25Q128JW
                    if (!isOctalFlash)
                    {
                        flexspi_pin_init(EXAMPLE_FLEXSPI, FLASH_PORT, kFLEXSPI_4PAD);
                        flexspi_clock_init(EXAMPLE_FLEXSPI, kFlexspiRootClkFreq_133MHz);
                        /* Update root clock */
                        deviceconfig.flexspiRootClk = flexspi_get_clock(EXAMPLE_FLEXSPI);
                        deviceconfig.flashSize = flashMemSizeInByte / 0x400;
                        s_flashBusyStatusPol    = WINBOND_FLASH_BUSY_STATUS_POL;
                        s_flashBusyStatusOffset = WINBOND_FLASH_BUSY_STATUS_OFFSET;
                        s_flashQuadEnableCfg    = WINBOND_FLASH_QUAD_ENABLE;
                        /* Re-init FlexSPI using custom LUT */
                        flexspi_nor_flash_init(EXAMPLE_FLEXSPI, customLUT_WINBOND_Quad, kFLEXSPI_ReadSampleClkLoopbackFromDqsPad);
                        /* Enter quad mode. */
                        status = flexspi_nor_enable_quad_mode(EXAMPLE_FLEXSPI);
                    }
#endif
                    break;
                }
#endif // WINBOND_DEVICE_SERIES

